tutorials/naca0009/openHFDIBRANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( -0.5 -0.5 0.0 )	// 000
	 ( 1.5 -0.5 0.0 )	// 001
	 ( 1.5 0.5 0.0 )	// 002
	 ( -0.5 0.5 0.0 )	// 003
	 ( -0.5 -0.5 0.004 )	// 004
	 ( 1.5 -0.5 0.004 )	// 005
	 ( 1.5 0.5 0.004 )	// 006
	 ( -0.5 0.5 0.004 )	// 007
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 500  250  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
			( 0  1  5  4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 1  2  6  5)
			( 3  2  6  7)
		);
	}

); 

mergePatchPairs 
( 
); 

