tutorials/naca0009/openHFDIBRANS/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  HFDIBRAS;

HFDIBRAS
{
    HFDIBRASModel	    HFDIBKOmega;
    turbulence          on;
    printCoeffs         on;
    disGSurfaceType     setValue;
    disGBoundaryValue   1.0;
    kSurfaceType        switched;
    kBoundaryValue      1.0;
}

// ************************************************************************* //
